{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - Ревью кода-5 🌶️\n",
    "\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран его первую (старшую) цифру.\n",
    "Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 2). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## code review;\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "while n > 0:\n",
    "\n",
    "    n %= 10\n",
    "\n",
    "print(n)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "n = int(input())\n",
    "while n > 9:\n",
    "    n = n // 10\n",
    "print(n)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
