{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Step 06 - Ревью кода-4 🌶️🌶️\n",
    "\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран максимальную цифру числа, кратную3.\n",
    "Если в числе нет цифр, кратных 3, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 5). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число 0 делится на любое натуральное число.\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить нужные строки кода."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## code review:\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "max_digit = n % 10\n",
    "\n",
    "while n > 0:\n",
    "\n",
    "    digit = n % 10\n",
    "\n",
    "    if digit % 3 == 0:\n",
    "\n",
    "        if digit < max_digit:\n",
    "\n",
    "            digit = max_digit\n",
    "\n",
    "    n = n % 10\n",
    "\n",
    "if max_digit == 0:\n",
    "\n",
    "    print('NO')\n",
    "\n",
    "else:\n",
    "\n",
    "    print(max_digit)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "n = int(input())\n",
    "max_digit = -1\n",
    "while n > 0:\n",
    "    digit = n % 10\n",
    "    if digit % 3 == 0:\n",
    "        if digit > max_digit:\n",
    "            max_digit = digit\n",
    "    n = n // 10\n",
    "if max_digit == -1:\n",
    "    print('NO')\n",
    "else:\n",
    "    print(max_digit)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
