{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 04 - Ревью кода-2 🌶️🌶️\n",
    "\n",
    "На обработку поступает последовательность из 10 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10 ** 6.\n",
    "Нужно написать программу, которая выводит на экран сумму всех отрицательных чисел последовательности и максимальное отрицательное число в последовательности.\n",
    "Если отрицательных чисел нет, требуется вывести на экран «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 5). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число x не превышает по абсолютной величине 10 ** 6, если −10 ** 6 ≤ x ≤ 10 ** 6.\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## code review:\n",
    " \n",
    "mx = 0\n",
    "\n",
    "s = 0\n",
    "\n",
    "for i in range(11):\n",
    "\n",
    "    x = int(input())\n",
    "\n",
    "    if x < 0:\n",
    "\n",
    "        s = x\n",
    "\n",
    "    if x > mx:\n",
    "\n",
    "        mx = x\n",
    "\n",
    "print(s)\n",
    "\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "mx = -10**6 - 1\n",
    "s = 0\n",
    "for i in range(10):\n",
    "    x = int(input())\n",
    "    if x < 0:\n",
    "        s += x\n",
    "    if x < 0 and x > mx:\n",
    "        mx = x\n",
    "if s < 0:\n",
    "    print(s)\n",
    "    print(mx)\n",
    "else:\n",
    "    print('NO')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
