{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 03 - Ревью кода-1 🌶️🌶️\n",
    "\n",
    "На обработку поступает последовательность из 10 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10 ** 6.\n",
    "Нужно написать программу, которая выводит на экран количество неотрицательных чисел последовательности и их произведение. Если неотрицательных чисел нет, требуется вывести на экран «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 4). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число x не превышает по абсолютной величине 10 ** 6, если −10 ** 6 ≤ x ≤ 10 ** 6.\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## code review:\n",
    " \n",
    "count = 0\n",
    "\n",
    "p = 0\n",
    "\n",
    "for i in range(1, 10):\n",
    "\n",
    "    x = int(input())\n",
    "\n",
    "    if x > 0:\n",
    "\n",
    "        p = p * x\n",
    "\n",
    "        count = count + 1\n",
    "\n",
    "if count > 0:\n",
    "\n",
    "    print(x)\n",
    "\n",
    "    print(p)\n",
    "\n",
    "else:\n",
    "\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "count = 0\n",
    "p = 1\n",
    "for i in range(10):\n",
    "    x = int(input())\n",
    "    if x >= 0:\n",
    "        p = p * x\n",
    "        count = count + 1\n",
    "if count > 0:\n",
    "    print(count)\n",
    "    print(p)\n",
    "else:\n",
    "    print('NO')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
