{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Ревью кода-3\n",
    "\n",
    "На обработку поступает последовательность из 7 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10 ** 6.\n",
    "Нужно написать программу, которая подсчитывает и выводит сумму всех чётных чисел последовательности или 0, если чётных чисел в последовательности нет.\n",
    "Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 4). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число x не превышает по абсолютной величине 10 ** 6, если -10 ** 6 ≤ x ≤ 10 ** 6.\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## code review:\n",
    "\n",
    "s = 1\n",
    "\n",
    "for i in range(1, 7):\n",
    "\n",
    "    n = input()\n",
    "\n",
    "    if i % 2 == 0:\n",
    "\n",
    "        s = s + n\n",
    "\n",
    "print(s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "s = 0\n",
    "for i in range(7):\n",
    "    n = int(input())\n",
    "    if n % 2 == 0:\n",
    "        s += n\n",
    "print(s)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
