{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 02 - Сумма двух списков\n",
    "\n",
    "На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел L и M. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков L и M. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 пробел.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются две строки текста, содержащие целые числа, разделенные символом пробела.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "**Примечание:** Количество чисел в обеих строках одинаковое."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "3 1 4 <br/>\n",
    "1 5 9 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "4 6 13 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 6 13\n"
     ]
    }
   ],
   "source": [
    "# 11.11.2021\n",
    "\n",
    "s1 = input().split()\n",
    "s2 = input().split()\n",
    "n1 = []\n",
    "n2 = []\n",
    "n3 = []\n",
    "\n",
    "for i in s1:\n",
    "    n1.append(int(i))\n",
    "\n",
    "for j in s2:\n",
    "    n2.append(int(j))\n",
    "\n",
    "for k in range(len(s1)):\n",
    "    n3.append(n1[k] + n2[k])\n",
    "   \n",
    "print(*n3)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
