{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 04 - Валидный номер 🌶️🌶️\n",
    "\n",
    "На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат:\n",
    "\n",
    "- abc-def-hijk или\n",
    "- 7-abc-def-hijk\n",
    "\n",
    "где a, b, c, d, e, f, h, i, j, k – цифры от 0 до 9.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести «YES» если строка является корректным телефонным номером и «NO» в противном случае.\n",
    "\n",
    "**Примечание:** Телефонный номер должен содержать только цифры и символ -, а количество цифр в каждой группе должны быть правильным."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "7-301-447-5820\n",
    "\n",
    "Sample Output: <br/>\n",
    "YES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "YES\n"
     ]
    }
   ],
   "source": [
    "# 11.11.2021\n",
    "\n",
    "s = input().split('-')\n",
    "flag = True\n",
    "\n",
    "if len(s) == 4 and len(s[0]) == 1 and s[0] == '7' and len(s[1]) == 3 and len(s[2]) == 3 and len(s[3]) == 4:\n",
    "    for i in range(len(s)):\n",
    "        if s[i].isdigit():\n",
    "            flag = True\n",
    "        else:\n",
    "            flag = False\n",
    "            break\n",
    "\n",
    "elif len(s) == 3 and len(s[0]) == 3 and len(s[1]) == 3 and len(s[2]) == 4:\n",
    "    for i in range(len(s)):\n",
    "        if s[i].isdigit():\n",
    "            flag = True\n",
    "        else:\n",
    "            flag = False\n",
    "            break\n",
    "            \n",
    "else:\n",
    "    flag = False\n",
    "\n",
    "if flag == True:\n",
    "    print('YES')\n",
    "    \n",
    "else:\n",
    "    print('NO')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
