{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 06 - Молодежный жаргон\n",
    "\n",
    "На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая преобразует каждое слово введенного текста в \"молодежный жаргон\" по следующему правилу:\n",
    "- первая буква каждого слова удаляется и ставится в конец слова; \n",
    "- затем в конец слова добавляется слог \"ки\".\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста на русском языке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "проспал почти всю ночь\n",
    "\n",
    "Sample Output: <br/>\n",
    "роспалпки очтипки сювки очьнки"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "роспалпки очтипки сювки очьнки\n"
     ]
    }
   ],
   "source": [
    "# 11.11.2021\n",
    "\n",
    "print(*[i[1:] + i[0] + 'ки' for i in input().split()])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
