{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_08 - Заглавные буквы\n",
    "На вход программе подается строка состоящая из имени и фамилии человека, разделенных одним пробелом. Напишите программу, которая проверяет, что имя и фамилия начинаются с заглавной буквы.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается строка.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести *«YES»* если имя и фамилия начинаются с заглавной буквы и *«NO»* в противном случае.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Строка содержит только буквы.\n",
    "\n",
    "## sample_input:\n",
    "chris alan <br>\n",
    "\n",
    "## sample_output:\n",
    "NO <br>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NO\n"
     ]
    }
   ],
   "source": [
    "# date: 28.10.2022\n",
    "\n",
    "string = input()\n",
    "\n",
    "if string == string.title():\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_09 - sWAP cASE\n",
    "На вход программе подается строка. Напишите программу, которая меняет регистр символов, другими словами замените все строчные символы заглавными и наоборот.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается строка.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести строку в соответствии с условием задачи.\n",
    "\n",
    "## sample_input:\n",
    "Swap Case <br>\n",
    "\n",
    "## sample_output:\n",
    "sWAP cASE <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sWAP cASE\n"
     ]
    }
   ],
   "source": [
    "# date: 28.10.2022\n",
    "\n",
    "string = input()\n",
    "print(string.swapcase())"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_10 - Хороший оттенок\n",
    "На вход программе подается строка текста. Напишите программу, которая определяет являться ли оттенок текста хорошим или нет. Текст имеет хороший оттенок, если содержит подстроку «хорош» во всевозможных регистрах.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается строка текста.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести *«YES»* если текст имеет хороший оттенок и *«NO»* в противном случае.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Текст содержащий хорош, ХОРОШ, Хорош, хОРОШ и т.д. имеет хороший оттенок.\n",
    "\n",
    "## sample_input:\n",
    "я очень хороший текст =) <br>\n",
    "\n",
    "## sample_output:\n",
    "YES <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "YES\n"
     ]
    }
   ],
   "source": [
    "# date: 28.10.2022\n",
    "\n",
    "string = input()\n",
    "string = string.lower()\n",
    "\n",
    "if 'хорош' in string:\n",
    "    print('YES')\n",
    "else:\n",
    "    print('NO')"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_11 - Нижний регистр\n",
    "На вход программе подается строка. Напишите программу, которая подсчитывает количество буквенных символов в нижнем регистре.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается строка.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести количество буквенных символов в нижнем регистре.\n",
    "\n",
    "## sample_input:\n",
    "abcABCD12345 <br>\n",
    "\n",
    "## sample_output:\n",
    "3 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "# date: 28.10.2022\n",
    "\n",
    "string = input()\n",
    "abc = 'qwertyuiopasdfghjklzxcvbnm'\n",
    "count_abc = 0\n",
    "\n",
    "for i in range(len(string)):\n",
    "    if string[i] in abc:\n",
    "        count_abc += 1\n",
    "\n",
    "print(count_abc)"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
