{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_04 - Символы в диапазоне\n",
    "На вход программе подаются два числа $a$ и $b$. Напишите программу, которая для каждого кодового значения в диапазоне от aa до bb (включительно), выводит соответствующий ему символ из таблицы символов Unicode.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается два натуральных числа, каждое на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "## sample_input:\n",
    "65 <br>\n",
    "70 <br>\n",
    "\n",
    "## sample_output:\n",
    "A B C D E F <br>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "A B C D E F "
     ]
    }
   ],
   "source": [
    "# date: 29.11.2021\n",
    "\n",
    "for i in range(int(input()), int(input()) + 1):\n",
    "    print(chr(i), end=' ')"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_05 - Простой шифр\n",
    "На вход программе подается строка текста. Напишите программу, которая переводит каждый ее символ в соответствующий ему код из таблицы символов Unicode.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается строка текста.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести кодовые значения символов строки разделенных одним символом пробела.\n",
    "\n",
    "## sample_input:\n",
    "Hello world! <br>\n",
    "\n",
    "## sample_output:\n",
    "72 101 108 108 111 32 119 111 114 108 100 33 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "72 101 108 108 111 32 119 111 114 108 100 33 "
     ]
    }
   ],
   "source": [
    "# date: 29.11.2021\n",
    "\n",
    "s = input()\n",
    "for i in range(len(s)):\n",
    "    print(ord(s[i]), end=' ')"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_06 - Шифр Цезаря 🌶️\n",
    "Легион Цезаря, созданный в 23 веке на основе Римской Империи не изменяет древним традициям и использует шифр Цезаря. Это их и подвело, ведь данный шифр очень простой. Однако в постапокалипсисе люди плохо знают все тонкости довоенного мира, поэтому ученые из НКР не могут понять как именно нужно декодировать данные сообщения. Напишите программу для декодирования этого шифра.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "В первой строке дается число $n$, ($1 \\le n \\le 25$) – сдвиг, во второй строке даётся закодированное сообщение в виде строки со строчными латинскими буквами.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести одну строку – декодированное сообщение. Обратите внимание, что нужно декодировать сообщение, а не закодировать.\n",
    "\n",
    "## sample_input:\n",
    "1 <br>\n",
    "bwfusvfupdbftbs <br>\n",
    "\n",
    "## sample_output:\n",
    "avetruetocaesar <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "avetruetocaesar"
     ]
    }
   ],
   "source": [
    "# date: 29.11.2021\n",
    "\n",
    "n, s = int(input()), input()\n",
    "\n",
    "for i in range(len(s)):\n",
    "    char = ord(s[i]) - n\n",
    "    if char < 97:\n",
    "        char += 26\n",
    "    print(chr(char), end='')"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
