{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Цифровой корень\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая находит цифровой корень данного числа. Цифровой корень числа n получается следующим образом: если сложить все цифры этого числа, затем все цифры найденной суммы и повторить этот процесс, то в результате будет получено однозначное число (цифра), которое и называется цифровым корнем данного числа.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести цифровой корень введенного числа.\n",
    "\n",
    "Примечание. Используйте вложенные циклы while."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "Sample Input:\n",
    "\n",
    "192\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "num = int(input())\n",
    "total_sum = 0\n",
    "\n",
    "while num != 0:\n",
    "    last_digital = num % 10\n",
    "    total_sum += last_digital\n",
    "    num //= 10\n",
    "\n",
    "num = total_sum\n",
    "digital_sum = 0\n",
    "\n",
    "while num > 0:\n",
    "     last_digital = num % 10\n",
    "     digital_sum += last_digital\n",
    "     num //= 10\n",
    "\n",
    "if digital_sum <= 9:\n",
    "    print(digital_sum)\n",
    "else:\n",
    "    total_sum2 = 0\n",
    "    while digital_sum != 0:\n",
    "        last_digital = digital_sum % 10\n",
    "        total_sum2 += last_digital\n",
    "        digital_sum //= 10\n",
    "    print(total_sum2)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
