{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 03 - Делители-1 🌶️\n",
    "\n",
    "На вход программе подается два натуральных числа a и b (a < b). Напишите программу, которая находит натуральное число из отрезка [a;b] с максимальной суммой делителей.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются два числа, каждое на отдельной строке.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести два числа на одной строке, разделенных пробелом: число с максимальной суммой делителей и сумму его делителей.\n",
    "\n",
    "Примечание. Если таких чисел несколько, то выведите наибольшее из них."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "Sample Input:\n",
    "\n",
    "1\n",
    "\n",
    "10\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "10 18"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 18\n"
     ]
    }
   ],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "a, b = int(input()), int(input())\n",
    "total_maximum = 0\n",
    "digital = 0\n",
    "\n",
    "for i in range(a, b + 1):\n",
    "    maximum = 0\n",
    "    for j in range(1, i + 1):\n",
    "        if i % j == 0:\n",
    "            maximum += j\n",
    "        if maximum >= total_maximum:\n",
    "            total_maximum = maximum\n",
    "            digital = j\n",
    "\n",
    "print(digital, total_maximum)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
