{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 13 - Merge lists 2\n",
    "\n",
    "На вход программе подается число n, а затем n строк, содержащих целые числа в порядке возрастания. Из данных строк формируются списки чисел. Напишите программу, которая объединяет указанные списки в один отсортированный список с помощью функции quick_merge(), а затем выводит его.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается натуральное число n, а затем n строк, содержащих целые числа в порядке возрастания, разделенные символом пробела.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "3 <br/>\n",
    "1 2 3 4 <br/>\n",
    "5 6 7 <br/>\n",
    "10 11 17 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "1 2 3 4 5 6 7 10 11 17 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 2 3 4 5 6 7 10 11 17\n"
     ]
    }
   ],
   "source": [
    "# 12.11.2021\n",
    "\n",
    "total_list = []\n",
    "for i in range(int(input())):\n",
    "    total_list.append([int(c) for c in input().split()])\n",
    "\n",
    "total_list2 = []\n",
    "for j in total_list:\n",
    "    for k in j:\n",
    "        total_list2.append(k)\n",
    "\n",
    "total_list2.sort()\n",
    "\n",
    "print(*total_list2)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
