{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_05 - I like Python\n",
    "Напишите программу, которая выводит на экран текст *«I\\*\\*\\*like\\*\\*\\*Python»* (без кавычек).\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Используйте необязательный параметр sep.\n",
    "\n",
    "## sample_input:\n",
    "\n",
    "## sample_output:\n",
    "I\\*\\*\\*like\\*\\*\\*Python"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I***like***Python\n"
     ]
    }
   ],
   "source": [
    "# date: 05.09.2021\n",
    "\n",
    "print('I', 'like', 'Python', sep = '***')"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_06 - Кастомный разделитель\n",
    "Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести введённые три строки через разделитель.\n",
    "\n",
    "## sample_input:\n",
    "\\* <br>\n",
    "Раз <br>\n",
    "Два <br>\n",
    "Три <br>\n",
    "\n",
    "## sample_output:\n",
    "Раз*Два*Три"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Раз*Два*Три\n"
     ]
    }
   ],
   "source": [
    "# date: 05.09.2021\n",
    "\n",
    "namesep= input()\n",
    "name1= input()\n",
    "name2= input()\n",
    "name3= input()\n",
    "print(name1, name2, name3, sep=namesep)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Раз*Два*Три\n"
     ]
    }
   ],
   "source": [
    "# date: 12.11.2022\n",
    "\n",
    "separator: str = input()\n",
    "word_0: str = input()\n",
    "word_1: str = input()\n",
    "word_2: str = input()\n",
    "\n",
    "print(word_0,\n",
    "      word_1,\n",
    "      word_2,\n",
    "      sep = separator)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Раз*Два*Три\n"
     ]
    }
   ],
   "source": [
    "# date: 12.11.2022\n",
    "\n",
    "print(input().join([input() for _ in range(3)]))"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_07 - Приветствие\n",
    "Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек), после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подаётся одна строка — имя пользователя.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Перед восклицательным знаком не должно быть пробелов.\n",
    "\n",
    "**Примечание №2:** <br>\n",
    "Используйте необязательный параметр end.\n",
    "\n",
    "## sample_input:\n",
    "Тирион\n",
    "\n",
    "## sample_output:\n",
    "Привет, Тирион!"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date: 05.09.2021\n",
    "\n",
    "name= input()\n",
    "print('Привет,', name, end='!')"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Привет, Тирион!"
     ]
    }
   ],
   "source": [
    "# date: 12.11.2022\n",
    "\n",
    "name: str = input()\n",
    "\n",
    "print(f'Привет, {name}',\n",
    "      end = '!')"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Привет, Тирион!"
     ]
    }
   ],
   "source": [
    "# date: 12.11.2022\n",
    "\n",
    "print(f'Привет, {input()}', end = '!')"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Привет, Тирион!"
     ]
    }
   ],
   "source": [
    "def hello_to_2(name: str) -> None:\n",
    "    print(f'Привет, {name}',\n",
    "          end = '!')\n",
    "\n",
    "hello_to_2('Тирион')"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
