/*  Step 02- Привет, Java!

Напишите программу, которая выводит на экран строку "Hello, Java!" (без кавычек)

test:
Sample Input:

Sample Output:
Hello, Java!
*/

class Step_1_2_02 {
    public static void main(String[] args)
    {
        System.out.println("Hello, Java!");
    }
}