-- Active: 1671137145177@@127.0.0.1@3306@interactive_sql
/* Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость),
а также вычислить налог на добавленную стоимость для полученных сумм (имя столбца НДС ),
который включен в стоимость и составляет k = 18%, а также стоимость книг (Стоимость_без_НДС) без него.
Значения округлить до двух знаков после запятой. В запросе для расчета НДС(tax) и Стоимости без НДС(S_without_tax) использовать следующие формулы: 
tax = (S * (k / 100)) / (1 + (k / 100))
S_without_tax = S / (1 + (k / 100))
*/

--16.12.2022
SELECT
    author,
    ROUND(SUM(amount * price), 2) AS 'Стоимость',
    ROUND(SUM(((amount * price) * 0.18) / (1 + 0.18)), 2) AS 'НДС',
    ROUND(SUM((amount * price) / (1 + 0.18)), 2) AS 'Стоимость_без_НДС'

FROM book

GROUP BY author