{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 03 - Повторяй за мной 1\n",
    "\n",
    "Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение нужное количество раз.\n",
    "\n",
    "Формат входных данных: В первой строке записано текстовое предложение, во второй — количество повторений.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести указанное текстовое предложение нужное количество раз. Каждое повторение должно начинаться с новой строки."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "Время - деньги!\n",
    "\n",
    "5\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "Время - деньги!\n",
    "\n",
    "Время - деньги!\n",
    "\n",
    "Время - деньги!\n",
    "\n",
    "Время - деньги!\n",
    "\n",
    "Время - деньги!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Время - деньги!\n",
      "Время - деньги!\n",
      "Время - деньги!\n",
      "Время - деньги!\n",
      "Время - деньги!\n"
     ]
    }
   ],
   "source": [
    "# 26.09.2021\n",
    "\n",
    "a = input()\n",
    "b = int(input())\n",
    "\n",
    "for i in range(b):\n",
    "    print(a)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
