{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Звездный прямоугольник\n",
    "\n",
    "На вход программе подается натуральное число n.\n",
    "\n",
    "Напишите программу, которая печатает звездный прямоугольник размерами n × 19.\n",
    "\n",
    "Формат входных данных: На вход программе подаётся натуральное число n ∈ [1;20] — высота звездного прямоугольника.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести звездный прямоугольник размерами n × 19.\n",
    "\n",
    "Подсказка. Для печати звездной линии используйте умножение строки на число."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "3\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "'*******************'\n",
    "\n",
    "'*******************'\n",
    "\n",
    "'*******************'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "*******************\n",
      "*******************\n",
      "*******************\n"
     ]
    }
   ],
   "source": [
    "# 01.10.2021\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a):\n",
    "    print('*******************')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
