{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08 - Квадрат числа\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая для каждого из чисел от 0 до n (включительно) выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).\n",
    "\n",
    "Формат входных данных: На вход программе подается натуральное число n.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "9\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "Квадрат числа 0 равен 0\n",
    "\n",
    "Квадрат числа 1 равен 1\n",
    "\n",
    "Квадрат числа 2 равен 4\n",
    "\n",
    "Квадрат числа 3 равен 9\n",
    "\n",
    "Квадрат числа 4 равен 16\n",
    "\n",
    "Квадрат числа 5 равен 25\n",
    "\n",
    "Квадрат числа 6 равен 36\n",
    "\n",
    "Квадрат числа 7 равен 49\n",
    "\n",
    "Квадрат числа 8 равен 64\n",
    "\n",
    "Квадрат числа 9 равен 81"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Квадрат числа 0 равен 0\n",
      "Квадрат числа 1 равен 1\n",
      "Квадрат числа 2 равен 4\n",
      "Квадрат числа 3 равен 9\n",
      "Квадрат числа 4 равен 16\n",
      "Квадрат числа 5 равен 25\n",
      "Квадрат числа 6 равен 36\n",
      "Квадрат числа 7 равен 49\n",
      "Квадрат числа 8 равен 64\n",
      "Квадрат числа 9 равен 81\n",
      "Квадрат числа 10 равен 100\n",
      "Квадрат числа 11 равен 121\n",
      "Квадрат числа 12 равен 144\n",
      "Квадрат числа 13 равен 169\n"
     ]
    }
   ],
   "source": [
    "# 01.10.2021\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a+1):\n",
    "    print('Квадрат числа', i, 'равен', i*i)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
