{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 09 - Звездный треугольник\n",
    "\n",
    "На вход программе подается натуральное число n(n≥2) – катет прямоугольного равнобедренного треугольника.\n",
    "\n",
    "Напишите программу, которая выводит звездный треугольник в соответствии с примером.\n",
    "\n",
    "Формат входных данных: На вход программе подается одно натуральное число n(n≥2).\n",
    "\n",
    "Формат выходных данных: Программа должна вывести треугольник в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "3\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "'***'\n",
    "\n",
    "'**'\n",
    "\n",
    "'*'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "***\n",
      "**\n",
      "*\n"
     ]
    }
   ],
   "source": [
    "# 01.10.2021\n",
    "\n",
    "a = int(input())\n",
    "for i in range(a):\n",
    "    print((a - i) * '*')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
