{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_08 - Список чисел\n",
    "На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n].\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "## sample_input:\n",
    "1\n",
    "\n",
    "## sample_output:\n",
    "[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "print(list(range(1, int(input()) + 1)))"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_02 - Список букв\n",
    "На вход программе подается одно число nn. Напишите программу, которая выводит список, состоящий из nn букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число n, \\, n \\le 26n,n≤26.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "## sample_input:\n",
    "5\n",
    "\n",
    "## sample_output:\n",
    "['a', 'b', 'c', 'd', 'e']"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "n = int(input())\n",
    "abc = list()\n",
    "\n",
    "if n <= 26:\n",
    "    for i in range(n):\n",
    "        abc += chr(i + 97)\n",
    "\n",
    "print(abc)"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
