{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_05 - Все сразу 2 🌶️\n",
    "Дополните приведенный код, чтобы он:\n",
    "\n",
    "Заменил второй элемент списка на 17;\n",
    "Добавил числа 4, 5 и 6 в конец списка;\n",
    "Удалил первый элемент списка;\n",
    "Удвоил список;\n",
    "Вставил число 25 по индексу 3;\n",
    "Вывел список, с помощью функции print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "numbers = [8, 9, 10, 11]\n",
    "\n",
    "numbers[1] = 17\n",
    "numbers.extend([4, 5, 6])\n",
    "del numbers[0]\n",
    "numbers *= 2\n",
    "numbers.insert(3, 25)\n",
    "\n",
    "print(numbers)"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_06 - Переставить min и max\n",
    "На вход программе подается строка текста, содержащая различные натуральные числа. Из данной строки формируется список чисел. Напишите программу, которая меняет местами минимальный и максимальный элемент этого списка.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая различные натуральные числа, разделенные символом пробела.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести строку текста в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Используйте подходящие встроенные функции и списочные методы.\n",
    "\n",
    "\n",
    "## sample_input:\n",
    "3 4 5 2 1\n",
    "\n",
    "## sample_output:\n",
    "3 4 1 2 5"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_07 - Количество артиклей\n",
    "На вход программе подается строка, содержащая английский текст. Напишите программу, которая подсчитывает общее количество артиклей: 'a', 'an', 'the'.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка, содержащая английский текст. Слова текста разделены символом пробела.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести общее количество артиклей 'a', 'an', 'the' вместе с поясняющим текстом.\n",
    "\n",
    "Примечание. Артикли могут начинаться с заглавной буквы 'A', 'An', 'The'.\n",
    "\n",
    "## sample_input:\n",
    "William Shakespeare was born in the town of Stratford, England, in the year 1564. When he was a young man, Shakespeare moved to the city of London, where he began writing plays. His plays were soon very successful, and were enjoyed both by the common people of London and also by the rich and famous. In addition to his plays, Shakespeare wrote many short poems and a few longer poems. Like his plays, these poems are still famous today.\n",
    "\n",
    "## sample_output:\n",
    "Общее количество артиклей: 7"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "string = input()\n",
    "string = string.split()\n",
    "count = 0\n",
    "\n",
    "for i in range(len(string)):\n",
    "    if string[i].lower() == 'a' or string[i].lower() == 'an' or string[i].lower() == 'the':\n",
    "        count += 1\n",
    "\n",
    "print('Общее количество артиклей:', count)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_08 - Взлом Братства Стали 🌶️\n",
    "Немалоизвестный в пустошах Мохаве Курьер забрел в Хидден-Вэли – секретный бункер Братства Стали, и любезно соглашается помочь им в решении их проблем. Одной из такой проблем являлся странный компьютерный вирус, который проявлялся в виде появления комментариев к программам на терминалах Братства Стали. Известно, что программисты Братства никогда не оставляют комментарии к коду, и пишут программы на Python, поэтому удаление всех этих комментариев никак не навредит им. Помогите писцу Ибсену удалить все комментарии из программы.\n",
    "\n",
    "Формат входных данных\n",
    "На первой строке вводится символ решётки и сразу же натуральное число nn — количество строк в программе, не считая первой. Далее следует nn строк кода.\n",
    "\n",
    "Формат выходных данных\n",
    "Нужно вывести те же строки, но удалить комментарии и символы пустого пространства в конце строк. Пустую строку вместо первой строки ввода выводить не надо.\n",
    "\n",
    "## sample_input:\n",
    "```python\n",
    "#12\n",
    "print(\"Введите своё имя\")\n",
    "name = input()\n",
    "print(\"Введите пароль, если имеется\")    # ахахахах вам не поймать меня\n",
    "password = input()\n",
    "if password == \"hoover\":\n",
    "    print(\"Здравствуйте, рыцарь\", name)         #долой Макнамару\n",
    "elif password == \"noncr\":\n",
    "    print(\"Здравствуйте, паладин\", name)\n",
    "elif password == \"gelios\":\n",
    "    print(\"Здравствуйте, старейшина\", name)          #Элайджа вперёд\n",
    "else:\n",
    "    print(\"Здравствуйте, послушник\", name)\n",
    "```\n",
    "\n",
    "## sample_output:\n",
    "```python\n",
    "print(\"Введите своё имя\")\n",
    "name = input()\n",
    "print(\"Введите пароль, если имеется\")\n",
    "password = input()\n",
    "if password == \"hoover\":\n",
    "    print(\"Здравствуйте, рыцарь\", name)\n",
    "elif password == \"noncr\":\n",
    "    print(\"Здравствуйте, паладин\", name)\n",
    "elif password == \"gelios\":\n",
    "    print(\"Здравствуйте, старейшина\", name)\n",
    "else:\n",
    "    print(\"Здравствуйте, послушник\", name)\n",
    "```"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "for i in range(int(input()[1:])):\n",
    "    string = input()\n",
    "    if '#' in string:\n",
    "        string = string[:string.rfind('#')]\n",
    "    print(string.rstrip())"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_11 - Сортировка чисел\n",
    "На вход программе подается строка текста, содержащая целые числа. Из данной строки формируется список чисел. Напишите программу, которая сортирует и выводит данный список сначала по возрастанию, а затем по убыванию.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается строка текста, содержащая целые числа, разделенные символом пробела.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести две строки текста в соответствии с условием задачи.\n",
    "\n",
    "## sample_input:\n",
    "4 5 1 2 3 8\n",
    "\n",
    "## sample_output:\n",
    "1 2 3 4 5 8\n",
    "8 5 4 3 2 1"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
