{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 10 - Очень странные дела\n",
    "\n",
    "Джим Хоппер с помощью радиоприемника пытается получить сообщение Оди. На приемник ему поступает n различных последовательностей кода Морзе. Декодировав их, он получает последовательности из цифр и строчного латинского алфавита, при этом во всех сообщениях Оди содержится число 11, причем минимум 3 раза. Помогите определить Джиму количество сообщений от Оди.\n",
    "\n",
    "**Формат входных данных:** В первой строке подаётся число n – количество сообщений, в последующих n строках вводятся строки, содержащие латинские строчные буквы и цифры.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести количество строк в которых содержится число 11 минимум 3 раза.\n",
    "\n",
    "**Примечание:** Числа 11 необязательно должны быть разделены другими символами, нужно подсчитать вхождение последовательности символов \"11\", т.е. например в строке \"111\" содержится одна такая последовательность, в то время как в \"1111\" их уже две."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "3 <br/>\n",
    "11helpme11jim11 <br/>\n",
    "avengers141414atta11ck <br/>\n",
    "k1lg0re11111l <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    }
   ],
   "source": [
    "# 28.10.2021\n",
    "\n",
    "num = int(input())\n",
    "count_11 = 0\n",
    "\n",
    "for i in range(num):\n",
    "    string = input()\n",
    "    if string.count('11') >= 3:\n",
    "        count_11 += 1\n",
    "\n",
    "print(count_11)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
