{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 09 - В одну строку 1\n",
    "\n",
    "На вход программе подается строка текста, содержащая слова. Напишите программу, которая выводит слова введенной строки в столбик.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста, содержащая слова, разделенные символом пробела.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "**Примечание:** Программу можно написать в одну строку кода."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "Умей ценить того кто без тебя не может\n",
    "\n",
    "Sample Output: <br/>\n",
    "Умей <br/>\n",
    "ценить <br/>\n",
    "того <br/>\n",
    "кто <br/>\n",
    "без <br/>\n",
    "тебя <br/>\n",
    "не <br/>\n",
    "может <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Умей\n",
      "ценить\n",
      "того\n",
      "кто\n",
      "без\n",
      "тебя\n",
      "не\n",
      "может\n"
     ]
    }
   ],
   "source": [
    "# 10.11.2021\n",
    "\n",
    "print(*[i for i in input().split()], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
