{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 11 - Сумма делителей\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая вычисляет сумму всех его делителей.\n",
    "\n",
    "Формат входных данных: На вход программе подается натуральное число n.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести единственное число в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Функция подсчета суммы всех делителей числа является очень важной в теории чисел."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "10\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "18"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "18\n"
     ]
    }
   ],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "import math\n",
    "\n",
    "n = int(input())\n",
    "s = 0\n",
    "r = int(math.sqrt(n))\n",
    "for i in range(1, r + 1):\n",
    "    if n % i == 0:\n",
    "        s += i\n",
    "        s += n // i\n",
    "if n / r == r:\n",
    "    s -= r\n",
    "\n",
    "print(s)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
