{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 13 - Наибольшие числа 🌶️🌶️\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке.\n",
    "Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.\n",
    "\n",
    "Формат входных данных: На вход программе подаются натуральное число n ≥ 2, а затем n различных натуральных чисел, каждое на отдельной строке.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести два наибольших числа, каждое на отдельной строке."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "5\n",
    "\n",
    "1\n",
    "\n",
    "2\n",
    "\n",
    "3\n",
    "\n",
    "4\n",
    "\n",
    "5\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "5\n",
    "\n",
    "4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# 10.10.2021\n",
    "\n",
    "longest = 0\n",
    "smalles = 0\n",
    "n = int(input())\n",
    "if n >= 2:\n",
    "    for i in range(n):\n",
    "        num = int(input())\n",
    "        \n",
    "        if num > longest:\n",
    "            smalles = longest\n",
    "            longest = num\n",
    "        elif num > smalles and num < longest:\n",
    "            smalles = num\n",
    "print(longest, smalles, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
