{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Количество чисел\n",
    "\n",
    "На вход программе подаются два целых числа a и b (a ≤ b). Напишите программу, которая подсчитывает количество чисел в диапазоне от a до b включительно, куб которых оканчивается на 4 или 9.\n",
    "\n",
    "Формат входных данных: На вход программе подаются два целых числа a и b (a ≤ b).\n",
    "\n",
    "Формат выходных данных: Программа должна вывести одно целое число в соответствии с условием программы.\n",
    "\n",
    "Примечание. Куб числа a – это его третья степень a ** 3."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "1\n",
    "\n",
    "10\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "# 02.10.2021\n",
    "\n",
    "counter = 0\n",
    "a, b = int(input()), int(input())\n",
    "if a <= b:\n",
    "    for i in range(a , b + 1):\n",
    "        if i**3 % 10 == 4 or i**3 % 10 == 9:\n",
    "            counter += 1\n",
    "    print(counter)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
