{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 09 - Факториал\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая вычисляет n!.\n",
    "\n",
    "Входные данные: На вход программе подается натуральное число n,(n ≤ 12).\n",
    "\n",
    "Выходные данные: Программа должна вывести единственное число в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Факториалом натурального числа n, называется произведение всех натуральных чисел от 1 до n, то есть n! = 1 * 2 * 3 * ... n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "3\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6\n"
     ]
    }
   ],
   "source": [
    "# 02.10.2021\n",
    "\n",
    "n = int(input())\n",
    "total = 1\n",
    "for i in range(1, n + 1):\n",
    "    total *= i\n",
    "print(total)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
