{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 10 - Без нулей\n",
    "\n",
    "Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.\n",
    "\n",
    "Формат входных данных: На вход программе подаются 10 целых чисел, каждое на отдельной строке.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести произведение отличных от нуля чисел.\n",
    "\n",
    "Примечание. Гарантируется, что хотя бы одно из 10 чисел является ненулевым."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "8\n",
    "\n",
    "0\n",
    "\n",
    "1\n",
    "\n",
    "2\n",
    "\n",
    "1\n",
    "\n",
    "0\n",
    "\n",
    "0\n",
    "\n",
    "5\n",
    "\n",
    "4\n",
    "\n",
    "12\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "3840"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3840\n"
     ]
    }
   ],
   "source": [
    "# 02.10.2021\n",
    "\n",
    "total = 1\n",
    "for i in range(10):\n",
    "    num = int(input())\n",
    "    if num > 0:\n",
    "        total *= num\n",
    "print(total)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
