{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - Все вместе\n",
    "\n",
    "Дано натуральное число. Напишите программу, которая вычисляет:\n",
    "- сумму его цифр;\n",
    "- количество цифр в нем;\n",
    "- произведение его цифр;\n",
    "- среднее арифметическое его цифр;\n",
    "- его первую цифру;\n",
    "- сумму его первой и последней цифры.\n",
    " \n",
    "Формат входных данных: На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести значения указанных величин в указанном порядке."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "5678\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "26\n",
    "\n",
    "4\n",
    "\n",
    "1680\n",
    "\n",
    "6.5\n",
    "\n",
    "5\n",
    "\n",
    "13"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "26\n",
      "4\n",
      "1680\n",
      "6.5\n",
      "5\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "# 25.10.2021\n",
    "\n",
    "num = int(input())\n",
    "sum_num = 0\n",
    "cnt_num = 0\n",
    "pro_num = 1\n",
    "last_num = num % 10\n",
    "revers = str()\n",
    "\n",
    "while num != 0:\n",
    "    last_digital = num % 10\n",
    "    sum_num += last_digital\n",
    "    cnt_num += 1\n",
    "    pro_num *= last_digital\n",
    "    revers = revers + str(last_digital)\n",
    "    num = num // 10\n",
    "\n",
    "print(sum_num)  # сумма\n",
    "print(cnt_num)  # количество\n",
    "print(pro_num)  # произведение\n",
    "print(sum_num / cnt_num)  # среднее\n",
    "print(int(revers) % 10)  # первая\n",
    "print(last_num + (int(revers) % 10))  # сумма первой и последней"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
