{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 06 - max и min\n",
    "\n",
    "Дано натуральное число n,(n ≥ 10). Напишите программу, которая определяет его максимальную и минимальную цифры.\n",
    "\n",
    "Формат входных данных: На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести максимальную и минимальную цифры введенного числа (с поясняющей надписью)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "26670\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "Максимальная цифра равна 7\n",
    "\n",
    "Минимальная цифра равна 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Максимальная цифра равна 7\n",
      "Минимальная цифра равна 0\n"
     ]
    }
   ],
   "source": [
    "# 25.10.2021\n",
    "\n",
    "num = int(input())\n",
    "num_min = num % 10\n",
    "num_max = num % 10\n",
    "\n",
    "while num != 0:\n",
    "    last_digital = num % 10\n",
    "    if last_digital > num_max:\n",
    "        num_max = last_digital\n",
    "    elif last_digital < num_min:\n",
    "        num_min = last_digital\n",
    "    num = num // 10\n",
    "\n",
    "print('Максимальная цифра равна', num_max)\n",
    "print('Минимальная цифра равна', num_min)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
