{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_07 - Наименьший делитель\n",
    "На вход программе подается число $n > 1$. Напишите программу, которая выводит его наименьший отличный от 1 делитель.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число nn.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести наименьший делитель отличный от 11.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Используйте оператор break при обнаружении делителя.\n",
    "\n",
    "## sample_input:\n",
    "15 <br>\n",
    "\n",
    "## sample_output:\n",
    "3 <br>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "for i in range(num + 1):\n",
    "    if i != 0 and i != 1:\n",
    "        if num % i == 0:\n",
    "            print(i)\n",
    "            break"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_08 - Следуй правилам\n",
    "На вход программе подается натуральное число nn. Напишите программу, которая выводит числа от 11 до nn включительно за исключением:\n",
    "* чисел от 55 до 99 включительно;\n",
    "* чисел от 1717 до 3737 включительно;\n",
    "* чисел от 7878 до 8787 включительно.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число nn.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести числа в соответствии с условием задачи, каждое на отдельной строке.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Используйте оператор *continue*.\n",
    "\n",
    "## sample_input:\n",
    "10 <br>\n",
    "\n",
    "## sample_output:\n",
    "1 <br>\n",
    "2 <br>\n",
    "3 <br>\n",
    "4 <br>\n",
    "10 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "for i in range(1, num + 1):\n",
    "    if i in range(5, 10) or i in range(17, 38) or i in range(78, 88):\n",
    "        continue\n",
    "    print(i)"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
