{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_03 - Ревью кода-1 🌶️🌶️\n",
    "На обработку поступает последовательность из 1010 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10^610\n",
    "6\n",
    " . Нужно написать программу, которая выводит на экран количество неотрицательных чисел последовательности и их произведение. Если неотрицательных чисел нет, требуется вывести на экран «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 44). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число xx не превышает по абсолютной величине 10^610\n",
    "6\n",
    " , если -10^6 \\le x \\le 10^6−10\n",
    "6\n",
    " ≤x ≤10\n",
    "6\n",
    " .\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "count = 0\n",
    "p = 0\n",
    "for i in range(1, 10):\n",
    "    x = int(input())\n",
    "    if x > 0:\n",
    "        p = p * x\n",
    "        count = count + 1\n",
    "if count > 0:\n",
    "    print(x)\n",
    "    print(p)\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_04 - Ревью кода-2 🌶️🌶️\n",
    "На обработку поступает последовательность из 1010 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10^610\n",
    "6\n",
    " . Нужно написать программу, которая выводит на экран сумму всех отрицательных чисел последовательности и максимальное отрицательное число в последовательности. Если отрицательных чисел нет, требуется вывести на экран «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 55). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число xx не превышает по абсолютной величине 10^610\n",
    "6\n",
    " , если -10^6 \\le x \\le 10^6−10\n",
    "6\n",
    " ≤x ≤10\n",
    "6\n",
    " .\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "mx = 0\n",
    "s = 0\n",
    "for i in range(11):\n",
    "    x = int(input())\n",
    "    if x < 0:\n",
    "        s = x\n",
    "    if x > mx:\n",
    "        mx = x\n",
    "print(s)\n",
    "print(mx)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_05 - Ревью кода-3\n",
    "На обработку поступает последовательность из 77 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10^610\n",
    "6\n",
    " . Нужно написать программу, которая подсчитывает и выводит сумму всех чётных чисел последовательности или 00, если чётных чисел в последовательности нет. Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 44). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число xx не превышает по абсолютной величине 10^610\n",
    "6\n",
    " , если -10^6 \\le x \\le 10^6−10\n",
    "6\n",
    " ≤x ≤10\n",
    "6\n",
    " .\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить необходимые строки кода."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "s = 1\n",
    "for i in range(1, 7):\n",
    "    n = input()\n",
    "    if i % 2 == 0:\n",
    "        s = s + n\n",
    "print(s)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_06 - Ревью кода-4 🌶️🌶️\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран максимальную цифру числа, кратную 33. Если в числе нет цифр, кратных 33, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 55). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание 1. Число 00 делится на любое натуральное число.\n",
    "\n",
    "Примечание 2. При необходимости вы можете добавить нужные строки кода."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "n = int(input())\n",
    "max_digit = n % 10\n",
    "while n > 0:\n",
    "    digit = n % 10\n",
    "    if digit % 3 == 0:\n",
    "        if digit < max_digit:\n",
    "            digit = max_digit\n",
    "    n = n % 10\n",
    "if max_digit == 0:\n",
    "    print('NO')\n",
    "else:\n",
    "    print(max_digit)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_07 - Ревью кода-5 🌶️\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран его первую (старшую) цифру. Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 22). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "n = int(input())\n",
    "while n > 0:\n",
    "    n %= 10\n",
    "print(n)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_08 - Ревью кода-6\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран произведение цифр введенного числа. Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их ровно 33). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date:\n",
    "\n",
    "n = input()\n",
    "product = n % 10\n",
    "while n >= 10:\n",
    "    digit = n % 10\n",
    "    product = product * digit\n",
    "    n //= 10\n",
    "print(product)"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
