{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# step_05 - Таблица-1\n",
    "Дано натуральное число $n$, ($n \\le 9$). Напишите программу, которая печатает таблицу размером $n \\times 3$ состоящую из данного числа (числа отделены одним пробелом).\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести таблицу размером $n \\times 3$ состоящую из данного числа.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "В конце строки может быть пробел.\n",
    "\n",
    "## sample_input:\n",
    "8 <br>\n",
    "\n",
    "## sample_output:\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>\n",
    "8 8 8 <br>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "for i in range(num):\n",
    "    for j in range(3):\n",
    "        print(num, end=' ')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_06 - Таблица-2\n",
    "Дано натуральное число $n$, ($n \\le 9$). Напишите программу, которая печатает таблицу размером $n \\times 5$, где в $i$-ой строке указано число $i$ (числа отделены одним пробелом).\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести таблицу размером n \\times 5n×5 в соответствии с условием.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "В конце строки может быть пробел.\n",
    "\n",
    "## sample_input:\n",
    "3 <br>\n",
    "\n",
    "## sample_output:\n",
    "1 1 1 1 1 <br>\n",
    "2 2 2 2 2 <br>\n",
    "3 3 3 3 3 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "for i in range(num):\n",
    "    for j in range(5):\n",
    "        print(i + 1, end=' ')\n",
    "    print()"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_07 - Таблица-3\n",
    "Дано натуральное число $n$, ($n \\le 9$). Напишите программу, которая печатает таблицу сложения для всех чисел от 1 до $n$ в соответствии с примером.\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести таблицу сложения для всех чисел от 11 до nn.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "В конце строки может быть пробел.\n",
    "\n",
    "## sample_input:\n",
    "1 <br>\n",
    "\n",
    "## sample_output:\n",
    "1 + 1 = 2 <br>\n",
    "1 + 2 = 3 <br>\n",
    "1 + 3 = 4 <br>\n",
    "1 + 4 = 5 <br>\n",
    "1 + 5 = 6 <br>\n",
    "1 + 6 = 7 <br>\n",
    "1 + 7 = 8 <br>\n",
    "1 + 8 = 9 <br>\n",
    "1 + 9 = 10 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "-----"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "for i in range(num):\n",
    "    for j in range(9):\n",
    "        print(i + 1, '+', (j + 1), '=', (i + 1) + (j + 1))\n",
    "    print()"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_08 - Звездный треугольник 🌶️🌶️\n",
    "Дано нечетное натуральное число $n$. Напишите программу, которая печатает равнобедренный звездный треугольник с основанием, равным $n$ в соответствии с примером:\n",
    "```\n",
    "*\n",
    "**\n",
    "***\n",
    "****\n",
    "***\n",
    "**\n",
    "*\n",
    "```\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно нечетное натуральное число.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести треугольник в соответствии с условием.\n",
    "\n",
    "**Примечание №1:** <br>\n",
    "Используйте вложенный цикл for.\n",
    "\n",
    "## sample_input:\n",
    "3 <br>\n",
    "\n",
    "## sample_output:\n",
    "```\n",
    "*\n",
    "**\n",
    "*\n",
    "```"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "if num % 2 != 0:\n",
    "    for i in range(num):\n",
    "        for j in range(i + 1):\n",
    "            print('*', end='')\n",
    "        if i == (num // 2):\n",
    "            print()\n",
    "            break\n",
    "        print()\n",
    "    for i in range(num):\n",
    "        for j in range(i + 1, (num // 2) + 1):\n",
    "            print('*', end='')\n",
    "        print()"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "# step_09 - Численный треугольник 1\n",
    "Дано натуральное число $n$. Напишите программу, которая печатает численный треугольник в соответствии с примером:\n",
    "\n",
    "1 <br>\n",
    "22 <br>\n",
    "333 <br>\n",
    "4444 <br>\n",
    "55555 <br>\n",
    "\n",
    "**Формат входных данных:** <br>\n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "**Формат выходных данных:** <br>\n",
    "Программа должна вывести треугольник в соответствии с условием.\n",
    "\n",
    "**Примечание №1:**\n",
    "Используйте вложенный цикл *for*.\n",
    "\n",
    "## sample_input:\n",
    "5 <br>\n",
    "\n",
    "## sample_output:\n",
    "1 <br>\n",
    "22 <br>\n",
    "333 <br>\n",
    "4444 <br>\n",
    "55555 <br>"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "# date: 26.12.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "for i in range(num + 1):\n",
    "    for j in range(i):\n",
    "        print(i, end='')\n",
    "    print()"
   ],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.5 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
