/*  Step 14 - Две строки

Напишите программу, которая выведет на экран "Hello Programming!" (без кавычек) на 2 строках, по слову на каждой (см. пример вывода)

test:
Sample Input:

Sample Output:
Hello
Programming!
*/

class Step_1_1_14
{
    public static void main(String[] args)
    {
        System.out.println("Hello");
        System.out.println("Programming!");
    }
}