/*  Step 10 

Напишите программу, которая выводит на экран строку  "Hello world!"

test:
Sample Input:
 
Sample Output:
Hello world!
*/

class Step_1_1_10
{
    public static void main(String[] args)
    {
        System.out.println("Hello world!");
    }
}