{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 12 - Удалите нечетные индексы\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу, которая создает из указанных чисел список, затем удаляет все элементы стоящие по нечетным индексам, а затем выводит полученный список.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести список в соответствии с условием задачи.\n",
    "\n",
    "**Примечание:** Используйте оператор del."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "10 <br/>\n",
    "0 <br/>\n",
    "1 <br/>\n",
    "2 <br/>\n",
    "3 <br/>\n",
    "4 <br/>\n",
    "5 <br/>\n",
    "6 <br/>\n",
    "7 <br/>\n",
    "8 <br/>\n",
    "9 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "[0, 2, 4, 6, 8]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[0, 2, 4, 6, 8]\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "n = int(input())\n",
    "num_list = []\n",
    "\n",
    "if n == 1:\n",
    "    num = int(input())\n",
    "    num_list.append(num)\n",
    "\n",
    "else:\n",
    "    for i in range(n):\n",
    "        n = int(input())\n",
    "        num_list.append(n)\n",
    "\n",
    "    del num_list[1::2]\n",
    "\n",
    "print(num_list)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
