{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 10 - Список делителей\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая создает список состоящий из делителей введенного числа.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается натуральное число n.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести список, состоящий из делителей введенного числа."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "17\n",
    "\n",
    "Sample Output: <br/>\n",
    "[1, 17]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[1, 17]\n"
     ]
    }
   ],
   "source": [
    "# 29.10.2021\n",
    "\n",
    "n = int(input())\n",
    "mylist = list()\n",
    "\n",
    "for i in range(1, n + 1):\n",
    "    if n % i == 0:\n",
    "        mylist.append(i)\n",
    "\n",
    "print(mylist)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
