{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - Список строк\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая создает из указанных строк список и выводит его.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести список состоящий из указанных строк."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "5 <br/>\n",
    "C# <br/>\n",
    "C++ <br/>\n",
    "C <br/>\n",
    "Python <br/>\n",
    "F# <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "['C#', 'C++', 'C', 'Python', 'F#']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['C#', 'C++', 'C', 'Python', 'F#']\n"
     ]
    }
   ],
   "source": [
    "# 29.10.2021\n",
    "\n",
    "mylist = list()\n",
    "for i in range(int(input())):\n",
    "    mylist.append(input())\n",
    "print(mylist)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
