{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 06 - Все вместе 2\n",
    "\n",
    "Дано натуральное число. Напишите программу, которая вычисляет:\n",
    "- количество цифр 3 в нем;\n",
    "- сколько раз в нем встречается последняя цифра;\n",
    "- количество четных цифр;\n",
    "- сумму его цифр, больших пяти;\n",
    "- произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести ее);\n",
    "- сколько раз в нем встречается цифры 0 и 5 (всего суммарно).\n",
    "\n",
    "Формат входных данных: На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести значения указанных величин в указанном порядке."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "56639\n",
    "\n",
    "Sample Output: <br/>\n",
    "1 <br/>\n",
    "1 <br/>\n",
    "2 <br/>\n",
    "21 <br/>\n",
    "9 <br/>\n",
    "1 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "num = int(input())\n",
    "last_digital = num % 10\n",
    "count_3 = 0\n",
    "count_ld = 0\n",
    "count_del2 = 0\n",
    "sum_digital_5 = 0\n",
    "mult_digital_7 = 1\n",
    "count_digital_05 = 0\n",
    "\n",
    "while num != 0:\n",
    "\n",
    "    # считаем количество цифр 3\n",
    "    if num % 10 == 3:\n",
    "        count_3 += 1\n",
    "    # считаем сколько раз встречается последняя цифра\n",
    "    if num % 10 == last_digital:\n",
    "        count_ld += 1\n",
    "    # считаем количество чётных цифр\n",
    "    if num % 2 == 0:\n",
    "        count_del2 += 1\n",
    "    # считаем сумму цифр больше 5\n",
    "    if num % 10 > 5:\n",
    "        num5 = num % 10\n",
    "        sum_digital_5 += num5\n",
    "    # считаем сумму цифр больше 7\n",
    "    if num % 10 > 7:\n",
    "        num7 = num % 10\n",
    "        mult_digital_7 *= num7\n",
    "    #\n",
    "    if num % 10 == 5 or num % 10 == 0:\n",
    "        num05 = num % 10\n",
    "        count_digital_05 += 1\n",
    "    # отсекаем последюю цифру\n",
    "    num //= 10\n",
    "\n",
    "print(count_3, count_ld, count_del2, sum_digital_5, mult_digital_7, count_digital_05, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
