{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 02 - Ревью кода - 8 🌶️\n",
    "\n",
    "На обработку поступает последовательность из 8 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10 ** 12. Нужно написать программу, которая выводит на экран количество делящихся нацело на 4 чисел в исходной последовательности и максимальное делящееся нацело на 4 число. Если делящихся нацело на 4 чисел нет, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## review code: <br/>\n",
    "\n",
    "n = 7 <br/>\n",
    "count = 0 <br/>\n",
    "maximum = 1000 <br/>\n",
    "for i in range(1, n + 1): <br/>\n",
    "    x = int(input()) <br/>\n",
    "    if x // 4 == 0: <br/>\n",
    "        count += 1 <br/>\n",
    "        if x < maximum: <br/>\n",
    "            maximum = x <br/>\n",
    "if count > 0: <br/>\n",
    "    print(count) <br/>\n",
    "    print(maximum) <br/>\n",
    "else: <br/>\n",
    "    print('NO') <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "count = 0\n",
    "maximum = -10**6\n",
    "for i in range(8):\n",
    "    x = int(input())\n",
    "    if x % 4 == 0 or x == 0:\n",
    "        count += 1\n",
    "        if x > maximum:\n",
    "            maximum = x\n",
    "if count > 0:\n",
    "    print(count)\n",
    "    print(maximum)\n",
    "else:\n",
    "    print('NO')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
