{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Третья цифра\n",
    "\n",
    "Дано натуральное число n(n > 99). Напишите программу, которая определяет его третью (с начала) цифру.\n",
    "\n",
    "Формат входных данных: На вход программе подается одно натуральное число, состоящее как минимум из трех цифр.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести его третью (с начала) цифру."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "100000000\n",
    "\n",
    "Sample Output: <br/>\n",
    "0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 26.10.2021\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "while num > 1000:\n",
    "    num //= 10\n",
    "\n",
    "last_digital = 0\n",
    "if 99 < num < 999:\n",
    "    last_digital = num % 10\n",
    "print(last_digital)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
