{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 01 - Ревью кода - 7 🌶️\n",
    "\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран сумму чётных цифр этого числа или 0, если чётных цифр в записи нет. Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## review code: <br/>\n",
    "\n",
    "n = input() <br/>\n",
    "s = 0 <br/>\n",
    "while n > 10: <br/>\n",
    "    if n % 2 == 1: <br/>\n",
    "        s = n % 10 <br/>\n",
    "    n //= 10 <br/>\n",
    "print(s) <br/>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "n = int(input())\n",
    "s = 0\n",
    "while n != 0:\n",
    "    ld = n % 10\n",
    "    if ld % 2 == 0:\n",
    "        s += ld\n",
    "    n //= 10\n",
    "print(s)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
