{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08 - Взлом Братства Стали 🌶️\n",
    "\n",
    "Немалоизвестный в пустошах Мохаве Курьер забрел в Хидден-Вэли – секретный бункер Братства Стали, и любезно соглашается помочь им в решении их проблем. Одной из такой проблем являлся странный компьютерный вирус, который проявлялся в виде появления комментариев к программам на терминалах Братства Стали. Известно, что программисты Братства никогда не оставляют комментарии к коду, и пишут программы на Python, поэтому удаление всех этих комментариев никак не навредит им. Помогите писцу Ибсену удалить все комментарии из программы.\n",
    "\n",
    "**Формат входных данных:** На первой строке вводится символ решётки и сразу же натуральное число n — количество строк в программе, не считая первой. Далее следует n строк кода.\n",
    "\n",
    "**Формат выходных данных:** Нужно вывести те же строки, но удалить комментарии и символы пустого пространства в конце строк. Пустую строку вместо первой строки ввода выводить не надо."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "#12 <br/>\n",
    "print(\"Введите своё имя\") <br/>\n",
    "name = input() <br/>\n",
    "print(\"Введите пароль, если имеется\")    # ахахахах вам не поймать меня <br/>\n",
    "password = input() <br/>\n",
    "if password == \"hoover\": <br/>\n",
    "    print(\"Здравствуйте, рыцарь\", name)         #долой Макнамару <br/>\n",
    "elif password == \"noncr\": <br/>\n",
    "    print(\"Здравствуйте, паладин\", name) <br/>\n",
    "elif password == \"gelios\": <br/>\n",
    "    print(\"Здравствуйте, старейшина\", name)          #Элайджа вперёд <br/>\n",
    "else: <br/>\n",
    "    print(\"Здравствуйте, послушник\", name) <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "print(\"Введите своё имя\") <br/>\n",
    "name = input() <br/>\n",
    "print(\"Введите пароль, если имеется\") <br/>\n",
    "password = input() <br/>\n",
    "if password == \"hoover\": <br/>\n",
    "    print(\"Здравствуйте, рыцарь\", name) <br/>\n",
    "elif password == \"noncr\": <br/>\n",
    "    print(\"Здравствуйте, паладин\", name) <br/>\n",
    "elif password == \"gelios\": <br/>\n",
    "    print(\"Здравствуйте, старейшина\", name) <br/>\n",
    "else: <br/>\n",
    "    print(\"Здравствуйте, послушник\", name) <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "print(\"Введите своё имя\")\n",
      "name = input()\n",
      "print(\"Введите пароль, если имеется\")\n",
      "password = input()\n",
      "if password == \"hoover\":\n",
      "print(\"Здравствуйте, рыцарь\", name)\n",
      "elif password == \"noncr\":\n",
      "print(\"Здравствуйте, паладин\", name)\n",
      "elif password == \"gelios\":\n",
      "print(\"Здравствуйте, старейшина\", name)\n",
      "else:\n",
      "print(\"Здравствуйте, послушник\", name)\n"
     ]
    }
   ],
   "source": [
    "# 09.11.2021\n",
    "\n",
    "for i in range(int(input()[1:])):\n",
    "    string = input()\n",
    "    if '#' in string:\n",
    "        string = string[:string.rfind('#')]\n",
    "    print(string.rstrip())"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
