{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08- Standard American Convention\n",
    "\n",
    "На вход программе подаётся натуральное число. Напишите программу, которая вставляет в заданное число запятые в соответствии со стандартным американским соглашением о запятых в больших числах.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаётся натуральное число n, (0 < n < 10 ** 100).\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести число с запятыми в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "1000000\n",
    "\n",
    "Sample Output: <br/>\n",
    "1,000,000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1,000,000\n"
     ]
    }
   ],
   "source": [
    "# 08.02.2022\n",
    "\n",
    "num = int(input())\n",
    "\n",
    "# Проверить, входит ли число в заданный диапазон;\n",
    "if 0 < num < 10 ** 100:\n",
    "    \n",
    "    # Проверить строковую длинну числа, если равно или меньше 3 -- вывести на печать\n",
    "    if len(str(num)) <= 3:\n",
    "        print(num)\n",
    "\n",
    "    # Если число больше или равно 4 -- разложить на \"элементы\" в Список\n",
    "    else:\n",
    "        num_list = list()\n",
    "        for i in range(len(str(num))):\n",
    "            num_list.append(str(num)[i])\n",
    "        \n",
    "        index = -3\n",
    "        # Проверить, делится ли строковая длина числа на 3 без остатка; \n",
    "        if len(str(num)) % 3 == 0:\n",
    "            for j in range((len(str(num)) // 3) - 1):\n",
    "                num_list.insert(index, ',')\n",
    "                index -= 4\n",
    "        \n",
    "        # Если число нечётное -- \n",
    "        elif len(str(num)) % 3 != 0:\n",
    "            for j in range((len(str(num)) // 3)):\n",
    "                num_list.insert(index, ',')\n",
    "                index -= 4\n",
    "        \n",
    "        # Собрать Строку в Число\n",
    "        num_total = str()\n",
    "        for k in range(len(num_list)):\n",
    "            num_total = ''.join(num_list)\n",
    "        \n",
    "        print(num_total)\n",
    "\n",
    "else:\n",
    "    print('Вне диапазона!')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
