{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 05 - Без дубликатов\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая выводит только уникальные строки, в том же порядке, в котором они были введены.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "**Примечание:** Считайте, что все строки состоят из строчных символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "5 <br/>\n",
    "first <br/>\n",
    "second <br/>\n",
    "first <br/>\n",
    "third <br/>\n",
    "second <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "first <br/>\n",
    "second <br/>\n",
    "third <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "first\n",
      "second\n",
      "third\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "string_list = []  # создаём пустой список для сбора информации\n",
    "\n",
    "for i in range(int(input())):  # запускаем цикл n-ное количество раз (число вводится пользователем)\n",
    "    new_string = input()  # ввод строки пользователем\n",
    "    string_list.append(new_string)  # добавление новой строки в список\n",
    "\n",
    "total_string_list = []  # создаём спимок для фильтрации дублей\n",
    "for j in range(len(string_list)):  # запускаем цикл\n",
    "    if string_list[j] not in total_string_list:  # определяем наличие элемента (по индексу) в списке (без дублей)\n",
    "        total_string_list.append(string_list[j])  # добавление элемента при отсутствии оного\n",
    "\n",
    "print(*total_string_list, sep='\\n')  # распаковка и вывод построчно"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
