{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 03 - Значение функции\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу, которая для каждого введенного числаx выводит значение функции: <br/>\n",
    "f(x) = x ** 2 + 2x + 1, каждое на отдельной строке.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести сначала введенные числа, затем пустую строку, а затем соответствующие значения функции.\n",
    "\n",
    "**Примечание:** Для первого теста имеем: <br/>\n",
    "f(1) = 1 ** 2 + 2 * 1 + 1 = 4 <br/>\n",
    "f(2) = 2 ** 2 + 2 * 2 + 1 = 9 <br/>\n",
    "f(3) = 3 ** 2 + 2 * 3 + 1 = 16 <br/>\n",
    "..."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "5 <br/>\n",
    "1 <br/>\n",
    "2 <br/>\n",
    "3 <br/>\n",
    "4 <br/>\n",
    "5 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "1 <br/>\n",
    "2 <br/>\n",
    "3 <br/>\n",
    "4 <br/>\n",
    "5 <br/>\n",
    "... <br/>\n",
    "4 <br/>\n",
    "9 <br/>\n",
    "16 <br/>\n",
    "25 <br/>\n",
    "36 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "\n",
      "4\n",
      "9\n",
      "16\n",
      "25\n",
      "36\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "n = int(input())\n",
    "num_list = []\n",
    "\n",
    "for i in range(n):\n",
    "    num = int(input())\n",
    "    num_list.append(num)\n",
    "\n",
    "print(*num_list, sep='\\n')\n",
    "print()\n",
    "\n",
    "for j in num_list:\n",
    "    f = j ** 2 + 2 * j + 1\n",
    "    print(f)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
