{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 04 - Remove outliers\n",
    "\n",
    "При анализе данных, собранных в рамках научного эксперимента, бывает полезно удалить самое большое и самое маленькое значение.\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n различных натуральных чисел. Напишите программу, которая удаляет наименьшее и наибольшее значение из указанных чисел, а затем выводит оставшиеся числа каждое на отдельной строке, не меняя их порядок.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "10 <br/>\n",
    "9 <br/>\n",
    "17 <br/>\n",
    "189 <br/>\n",
    "3 <br/>\n",
    "55 <br/>\n",
    "78 <br/>\n",
    "11 <br/>\n",
    "7 <br/>\n",
    "888 <br/>\n",
    "160 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "9 <br/>\n",
    "17 <br/>\n",
    "189 <br/>\n",
    "55 <br/>\n",
    "78 <br/>\n",
    "11 <br/>\n",
    "7 <br/>\n",
    "160 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9\n",
      "17\n",
      "189\n",
      "55\n",
      "78\n",
      "11\n",
      "7\n",
      "160\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "n = int(input())\n",
    "num_list = []\n",
    "\n",
    "for i in range(n):\n",
    "    num_list.append(int(input()))\n",
    "\n",
    "num_list.remove(min(num_list))\n",
    "num_list.remove(max(num_list))\n",
    "\n",
    "print(*num_list, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
