{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - Google search - 2 🌶️🌶️\n",
    "\n",
    "На вход программе подается натуральное число n, затем n строк, затем число k — количество поисковых запросов, затем k строк — поисковые запросы. Напишите программу, которая выводит все введенные строки, в которых встречаются все поисковые запросы.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n — количество строк, затем сами строки в указанном количестве, затем число k, затем сами поисковые запросы.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести все введенные строки, в которых встречаются все поисковые запросы.\n",
    "\n",
    "**Примечание:** Поиск не должен быть чувствителен к регистру символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "5 <br/>\n",
    "Язык Python прекрасен <br/>\n",
    "C# - отличный язык программирования <br/>\n",
    "Stepik - отличная платформа <br/>\n",
    "BEEGEEK FOREVER! <br/>\n",
    "язык Python появился 20 февраля 1991 <br/>\n",
    "2 <br/>\n",
    "язык <br/>\n",
    "python <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "Язык Python прекрасен <br/>\n",
    "язык Python появился 20 февраля 1991 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Язык Python прекрасен\n",
      "язык Python появился 20 февраля 1991\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "string_list = []  # список строк\n",
    "\n",
    "for i in range(int(input())):  # запускаем цикл (n-раз задаётся пользователем)\n",
    "    new_string = input()  # считываем строковые данные\n",
    "    string_list.append(new_string)  # добавляем данные в список\n",
    "\n",
    "search_list = []  #\n",
    "\n",
    "for j in range(int(input())):  # запускаем цикл (n-раз задаётся пользователем)\n",
    "    new_search_string = input()  # считываем строковые данные запросов\n",
    "    search_list.append(new_search_string)  # добавление данных запросов в список\n",
    "\n",
    "search_result = []  # список из запросов\n",
    "\n",
    "for string in range(len(string_list)):  # цикл перебирает \"строки\" из списка\n",
    "    flag = True\n",
    "    for search in range(len(search_list)):  # цикл перебирает \"запросы\" из списка\n",
    "        if search_list[search].lower() not in string_list[string].lower():  # ищем \"запрос\" в \"поисковой строке\"\n",
    "            flag = False  # если \"запроса\" нет, флаг - False\n",
    "    if flag == True:  # если флаг, после поиска всех \"запросов\", остался - True\n",
    "        search_result.append(string_list[string])  # добавляем строку в список к выводу\n",
    "\n",
    "print(*search_result, sep='\\n')  # распаковываем список и выводим результат построчно"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
