{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 06 - Google search - 1\n",
    "\n",
    "На вход программе подается натуральное число n, затем n строк, затем еще одна строка — поисковый запрос. Напишите программу, которая выводит все введенные строки, в которых встречается поисковый запрос.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n — количество строк, затем сами строки в указанном количестве, затем один поисковый запрос.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести все введенные строки, в которых встречается поисковый запрос.\n",
    "\n",
    "**Примечание:** Поиск не должен быть чувствителен к регистру символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "5 <br/>\n",
    "Язык Python прекрасен <br/>\n",
    "C# - отличный язык программирования <br/>\n",
    "Stepik - отличная платформа <br/>\n",
    "BEEGEEK FOREVER! <br/>\n",
    "язык Python появился 20 февраля 1991 <br/>\n",
    "язык <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "Язык Python прекрасен <br/>\n",
    "C# - отличный язык программирования <br/>\n",
    "язык Python появился 20 февраля 1991 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Язык Python прекрасен\n",
      "C# - отличный язык программирования\n",
      "язык Python появился 20 февраля 1991\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "string_list = []\n",
    "\n",
    "for i in range(int(input())):\n",
    "    new_string = input()\n",
    "    string_list.append(new_string)\n",
    "\n",
    "search_string = input()\n",
    "\n",
    "search_result = []\n",
    "\n",
    "for i in range(len(string_list)):\n",
    "    if search_string.lower() in string_list[i].lower():\n",
    "        search_result.append(string_list[i])\n",
    "\n",
    "print(*search_result, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
