{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08 - Negatives, Zeros and Positives\n",
    "\n",
    "На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу, которая сначала выводит все отрицательные числа, затем нули, а затем все положительные числа, каждое на отдельной строке. Числа должны быть выведены в том же порядке, в котором они были введены.\n",
    "\n",
    "**Формат входных данных:** На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "7 <br/>\n",
    "3 <br/>\n",
    "-4 <br/>\n",
    "1 <br/>\n",
    "0 <br/>\n",
    "-1 <br/>\n",
    "0 <br/>\n",
    "-2 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "-4 <br/>\n",
    "-1 <br/>\n",
    "-2 <br/>\n",
    "0 <br/>\n",
    "0 <br/>\n",
    "3 <br/>\n",
    "1 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-4\n",
      "-1\n",
      "-2\n",
      "0\n",
      "0\n",
      "3\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# 31.10.2021\n",
    "\n",
    "negative_num_list = []\n",
    "zero_num_list = []\n",
    "positive_num_list = []\n",
    "\n",
    "for i in range(int(input())):\n",
    "    n = int(input())\n",
    "    if n < 0:\n",
    "        negative_num_list.append(n)\n",
    "    elif n == 0:\n",
    "        zero_num_list.append(n)\n",
    "    else:\n",
    "        positive_num_list.append(n)\n",
    "\n",
    "print(*negative_num_list, sep='\\n')\n",
    "print(*zero_num_list, sep='\\n')\n",
    "print(*positive_num_list, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
