{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 04 - Инициалы\n",
    "\n",
    "На вход программе подается строка текста, содержащая имя, отчество и фамилию человека. Напишите программу, которая выводит инициалы человека.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста, содержащая имя, отчество и фамилию человека.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "Владимир Семенович Высоцкий\n",
    "\n",
    "Sample Output: <br/>\n",
    "В.С.В."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "В.С.В."
     ]
    }
   ],
   "source": [
    "# 05.11.2021\n",
    "\n",
    "s = input()\n",
    "fio = []\n",
    "s = s.split()\n",
    "\n",
    "for i in range(len(s)):\n",
    "    fio.append(s[i][0])\n",
    "\n",
    "print('.'.join(fio), end='.', sep='')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
