{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - Корректный ip-адрес\n",
    "\n",
    "На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой. Напишите программу, которая определяет является ли введенная строка текста корректным ip-адресом.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести «ДА», если введеная строка является корректным ip-адресом, и «НЕТ» — в противном случае.\n",
    "\n",
    "**Примечание:** ip-адрес является корректным, если все 4 числа находятся в диапазоне от 0 до 255 включительно."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "192.168.0.3\n",
    "\n",
    "Sample Output: <br/>\n",
    "ДА"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ДА\n"
     ]
    }
   ],
   "source": [
    "# 05.11.2021\n",
    "\n",
    "ip = input()\n",
    "ip = ip.split('.')\n",
    "flag = True\n",
    "\n",
    "if len(ip) == 4:\n",
    "    for i in range(4):\n",
    "        if int(ip[i]) < 0 or int(ip[i]) > 255:\n",
    "            flag = False\n",
    "            \n",
    "if flag == True:\n",
    "    print('ДА')\n",
    "else:\n",
    "    print('НЕТ')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
