{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 09 - Орел и решка\n",
    "\n",
    "Дана строка текста, состоящая из букв русского алфавита \"О\" и \"Р\". Буква \"О\" – соответствует выпадению Орла, а буква \"Р\" – соответствует выпадению Решки. Напишите программу, которая подсчитывает наибольшее количество подряд выпавших Решек.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста, состоящая из букв русского алфавита \"О\" и \"Р\".\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести наибольшее количество подряд выпавших Решек.\n",
    "\n",
    "**Примечание:** Если выпавших Решек нет, то необходимо вывести число 0."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "ОРРОРОРООРРРО\n",
    "\n",
    "Sample Output: <br/>\n",
    "3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "# 01.05.2022\n",
    "\n",
    "string = input().split(\"О\")\n",
    "\n",
    "res = 0\n",
    "for i in range(len(string)):\n",
    "    if len(string[i]) > res:\n",
    "        res = len(string[i])\n",
    "    else:\n",
    "        continue\n",
    "\n",
    "print(res)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
