{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 06 - Произведение чисел\n",
    "\n",
    "Напишите программу для определения, является ли число произведением двух чисел из данного набора, выводящую результат в виде ответа «ДА» или «НЕТ».\n",
    "\n",
    "**Формат входных данных:** В первой строке подаётся число n(0 < n < 1000) – количество чисел в наборе. В последующих n строках вводятся целые числа, составляющие набор (могут повторяться). Затем следует целое число, которое является или не является произведением двух каких-то чисел из набора.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести «ДА» или «НЕТ» в соответствии с условием задачи.\n",
    "\n",
    "**Примечание 1:** Само на себя число из набора умножиться не может, другими словами, два множителя должны иметь разные индексы в наборе.\n",
    "\n",
    "**Примечание 2:** Для решения задачи используйте вложенные циклы."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "3 <br/>\n",
    "33 <br/>\n",
    "17 <br/>\n",
    "35 <br/>\n",
    "999 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "НЕТ <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "НЕТ\n"
     ]
    }
   ],
   "source": [
    "# 01.05.2022\n",
    "\n",
    "from itertools import combinations\n",
    "\n",
    "arr = [int(input()) for _ in range(int(input()))]\n",
    "result = int(input())\n",
    "\n",
    "flag = False\n",
    "for i in combinations(arr, 2):\n",
    "    if i[0] * i[1] == result:\n",
    "        flag = True\n",
    "        break\n",
    "\n",
    "if flag:\n",
    "    print(\"ДА\")\n",
    "else:\n",
    "    print(\"НЕТ\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
