{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 04 - Сдвиг в развитии\n",
    "\n",
    "На вход программе подается строка текста из натуральных чисел. Из элементов строки формируется список чисел. Напишите программу циклического сдвига элементов списка направо, когда последний элемент становится первым, а остальные сдвигаются на одну позицию вперед, в сторону увеличения индексов.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста из разделенных пробелами натуральных чисел.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести элементы измененного списка с циклическим сдвигом, разделяя его элементы одним пробелом."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "489 483 43 2 3 84 1 4 3 2 5 4 3 13\n",
    "\n",
    "Sample Output: <br/>\n",
    "13 489 483 43 2 3 84 1 4 3 2 5 4 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "13 489 483 43 2 3 84 1 4 3 2 5 4 3\n"
     ]
    }
   ],
   "source": [
    "# 01.04.2022\n",
    "\n",
    "num_str = input().split()\n",
    "\n",
    "num_list = []\n",
    "num_list.append(num_str[-1])\n",
    "\n",
    "for i in range(len(num_str) - 1):\n",
    "    num_list.append(num_str[i])\n",
    "\n",
    "print(*num_list)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
