{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 03 - Назад, вперёд и наоборот\n",
    "\n",
    "На вход программе подается строка текста из натуральных чисел. Из элементов строки формируется список чисел. Напишите программу, которая меняет местами соседние элементы списка (a[0] c a[1], a[2] c a[3] и т.д.). Если в списке нечетное количество элементов, то последний остается на своем месте.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается строка текста, содержащая натуральные числа, разделенные пробелами.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести измененный список, разделяя его элементы одним пробелом."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "1 2 3 4 5\n",
    "\n",
    "Sample Output: <br/>\n",
    "2 1 4 3 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 1 4 3 5\n"
     ]
    }
   ],
   "source": [
    "# 01.04.2022\n",
    "\n",
    "num_str = input().split()\n",
    "\n",
    "if len(num_str) % 2 == 0:\n",
    "    num_list = []\n",
    "    for i in range(0, len(num_str), 2):\n",
    "        num_list.append(num_str[i + 1])\n",
    "        num_list.append(num_str[i])\n",
    "    \n",
    "elif len(num_str) % 2 != 0:\n",
    "    num_list = []\n",
    "    for i in range(0, len(num_str) - 1, 2):\n",
    "        num_list.append(num_str[i + 1])\n",
    "        num_list.append(num_str[i])\n",
    "    \n",
    "    num_list.append(num_str[-1])\n",
    "\n",
    "print(*num_list)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
