{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 01 - Координатные четверти\n",
    "\n",
    "Дан набор точек на координатной плоскости. Необходимо подсчитать и вывести количество точек, лежащих в каждой координатной четверти.\n",
    "\n",
    "**Формат входных данных:** В первой строке записано количество точек. Каждая следующая строка состоит из двух целых чисел — координат точки (сначала абсцисса – x, затем ордината – y), разделенных символом пробела.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести количество точек, лежащих в каждой координатной четверти, как в примерах.\n",
    "\n",
    "**Примечание:** Учтите, что точки, лежащие на осях координат, не принято относить к какой-либо координатной четверти."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "10 <br/>\n",
    "4 8 <br/>\n",
    "-3 -1 <br/>\n",
    "-4 9 <br/>\n",
    "4 0 <br/>\n",
    "-4 0 <br/>\n",
    "5 -2 <br/>\n",
    "0 0 <br/>\n",
    "1 1 <br/>\n",
    "13 -3 <br/>\n",
    "-43 3 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "Первая четверть: 2 <br/>\n",
    "Вторая четверть: 2 <br/>\n",
    "Третья четверть: 1 <br/>\n",
    "Четвертая четверть: 2 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Первая четверть: 2\n",
      "Вторая четверть: 2\n",
      "Третья четверть: 1\n",
      "Четвертая четверть: 2\n"
     ]
    }
   ],
   "source": [
    "# 20.02.2022\n",
    "\n",
    "n = int(input())\n",
    "first_quarter = 0\n",
    "second_quarter = 0\n",
    "third_quarter = 0\n",
    "fourth_quarter = 0\n",
    "\n",
    "for i in range(n):\n",
    "    coordinates = input().split(' ')\n",
    "    if int(coordinates[0]) > 0 and int(coordinates[1]) > 0:\n",
    "        first_quarter += 1\n",
    "    if int(coordinates[0]) < 0 and int(coordinates[1]) > 0:\n",
    "        second_quarter += 1\n",
    "    if int(coordinates[0]) < 0 and int(coordinates[1]) < 0:\n",
    "        third_quarter += 1\n",
    "    if int(coordinates[0]) > 0 and int(coordinates[1]) < 0:\n",
    "        fourth_quarter += 1\n",
    "\n",
    "print(\n",
    "    f'Первая четверть: {first_quarter}',\n",
    "    f'Вторая четверть: {second_quarter}',\n",
    "    f'Третья четверть: {third_quarter}',\n",
    "    f'Четвертая четверть: {fourth_quarter}',\n",
    "    sep = '\\n'\n",
    ")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0b3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
