{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 09 - Последовательность чисел 3 🌶️\n",
    "\n",
    "Даны два целых числа m и n (m > n). Напишите программу, которая выводит все нечетные числа от m до n включительно в порядке убывания.\n",
    "\n",
    "Формат входных данных: На вход программе подаются два целых числа m и n, каждое на отдельной строке.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести числа в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Попробуйте решить задачу двумя способами: с использованием условного оператора if и без него."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "77\n",
    "\n",
    "62\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "77\n",
    "\n",
    "75\n",
    "\n",
    "73\n",
    "\n",
    "71\n",
    "\n",
    "69\n",
    "\n",
    "67\n",
    "\n",
    "65\n",
    "\n",
    "63"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "77\n",
      "75\n",
      "73\n",
      "71\n",
      "69\n",
      "67\n",
      "65\n",
      "63\n"
     ]
    }
   ],
   "source": [
    "# 01.10.2021\n",
    "\n",
    "m, n = int(input()), int(input())\n",
    "\n",
    "if m > n:\n",
    "    if m % 2 != 0:\n",
    "        for i in range(m, n, -2):\n",
    "            print(i)\n",
    "    elif m % 2 == 0:\n",
    "        for j in range(m - 1, n - 1, -2):\n",
    "            print(j)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
