{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 14 - Ведьмаку заплатите чеканной монетой\n",
    "\n",
    "Всем известно, что ведьмак способен одолеть любых чудовищ, однако его услуги обойдутся недешево, к тому же ведьмак не принимает купюры, он принимает только чеканные монеты. В мире ведьмака существуют монеты с номиналами 1, 5, 10, 25.\n",
    "\n",
    "Напишите программу, которая определяет какое минимальное количество чеканных монет нужно заплатить ведьмаку.\n",
    "\n",
    "Формат входных данных: На вход программе подается одно натуральное число, цена за услугу ведьмака.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести минимально возможное количество чеканных монет для оплаты."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "49\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7\n"
     ]
    }
   ],
   "source": [
    "# 25.10.2021\n",
    "\n",
    "total = int(input())\n",
    "total_coin = 0\n",
    "coin1 = 1\n",
    "coin5 = 5\n",
    "coin10 = 10\n",
    "coin25 = 25\n",
    "\n",
    "while total >= 25:\n",
    "    if (total - coin25) >= 0:\n",
    "        total_coin += 1\n",
    "        total -= coin25\n",
    "while 10 <= total < 25:\n",
    "    if (total - coin10) >= 0:\n",
    "        total_coin += 1\n",
    "        total -= coin10\n",
    "while 5 <= total < 10:\n",
    "    if (total - coin5) >= 0:\n",
    "        total_coin += 1\n",
    "        total -= coin5\n",
    "while 0 < total <5:\n",
    "    if (total - coin1) >= 0:\n",
    "        total_coin += 1\n",
    "        total -= coin1\n",
    "\n",
    "print(total_coin)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
