{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 11 - Пока делимся\n",
    "\n",
    "На вход программе подается последовательность целых чисел делящихся на 7, каждое число на отдельной строке. Концом последовательности является любое число не делящееся на 7. Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "Формат входных данных: На вход программе подается последовательность чисел, каждое число на отдельной строке.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести члены данной последовательности."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "49\n",
    "\n",
    "2401\n",
    "\n",
    "4809\n",
    "\n",
    "0\n",
    "\n",
    "2\n",
    "\n",
    "10\n",
    "\n",
    "100\n",
    "\n",
    "Sample Output:\n",
    "\n",
    "49\n",
    "\n",
    "2401\n",
    "\n",
    "4809\n",
    "\n",
    "0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "49\n",
      "2401\n",
      "4809\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "# 25.10.2021\n",
    "\n",
    "num = int(input())\n",
    "while num % 7 == 0:\n",
    "    print(num)\n",
    "    num = int(input())"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
