{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08 - До КОНЦА 1\n",
    "\n",
    "На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является слово «КОНЕЦ» (без кавычек). Напишите программу, которая выводит члены данной последовательности.\n",
    "\n",
    "Формат входных данных: На вход программе подается последовательность слов, каждое слово на отдельной строке.\n",
    "\n",
    "Формат выходных данных: Программа должна вывести члены данной последовательности."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test:\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "Fus\n",
    "\n",
    "Ro\n",
    "\n",
    "КОНЕЦ\n",
    "\n",
    "Dah"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fus\n",
      "Ro\n"
     ]
    }
   ],
   "source": [
    "# 25.10.2021\n",
    "\n",
    "word = input()\n",
    "while word != 'КОНЕЦ':\n",
    "    print(word)\n",
    "    word = input()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.4 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
