{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 11 - Цифра 2\n",
    "\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "Hi Python\n",
    "\n",
    "Sample Output: <br/>\n",
    "Цифр нет"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "flag = True\n",
    "\n",
    "for i in range(len(string)):\n",
    "    if string[i] in '1234567890':\n",
    "        flag = False\n",
    "\n",
    "if flag == True:\n",
    "    print('Цифр нет')\n",
    "else:\n",
    "    print('Цифра')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
