{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 13 - Одинаковые соседи\n",
    "\n",
    "На вход программе подается одна строка. Напишите программу, которая определяет сколько в ней одинаковых соседних символов.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести количество одинаковых соседних символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "abcd\n",
    "\n",
    "Sample Output: <br/>\n",
    "0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "first_char = str()\n",
    "second_char = str()\n",
    "count = 0\n",
    "\n",
    "for i in range(len(string)):\n",
    "    second_char = string[i]\n",
    "    if second_char == first_char:\n",
    "        count += 1\n",
    "    first_char = second_char\n",
    "\n",
    "print(count)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
