{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 08 - В столбик 2\n",
    "\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит в столбик элементы строки в обратном порядке.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести в столбик элементы строки в обратном порядке. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "abc\n",
    "\n",
    "Sample Output: <br/>\n",
    "c <br/>\n",
    "b <br/>\n",
    "a <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "for i in range(len(string)):\n",
    "    print(string[-(i + 1)])"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
