{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 14 - Гласные и согласные\n",
    "\n",
    "На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет количество гласных и согласных букв.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести количество гласных и согласных букв.\n",
    "\n",
    "**Примечание:** В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "Вдохновение – это умение приводить себя в рабочее состояние! <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "Количество гласных букв равно 25 <br/>\n",
    "Количество согласных букв равно 24 <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "count_gl = 0\n",
    "count_slg = 0\n",
    "\n",
    "for i in range(len(string)):\n",
    "    if string[i] in 'АаУуОоЫыИиЭэЯяЮюЁёЕе':\n",
    "        count_gl += 1\n",
    "    if string[i] in 'БбВвГгДдЖжЗзЙйКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ':\n",
    "        count_slg += 1\n",
    "\n",
    "print('Количество гласных букв равно', count_gl)\n",
    "print('Количество согласных букв равно', count_slg)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
