{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 07 - В столбик 1\n",
    "\n",
    "На вход программе подается одна строка. Напишите программу, которая выводит элементы строки с индексами 0, 2, 4, ... в столбик.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается одна строка.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести элементы строки с индексами 0, 2, 4, ..., каждое на отдельной строке."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "abcdefghijklmnop\n",
    "\n",
    "Sample Output: <br/>\n",
    "a <br/>\n",
    "c <br/>\n",
    "e <br/>\n",
    "g <br/>\n",
    "i <br/>\n",
    "k <br/>\n",
    "m <br/>\n",
    "o <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "for i in range(0, len(string), 2):\n",
    "    print(string[i])"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
