{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 10 - Цифра 1\n",
    "\n",
    "На вход программе подается одна строка состоящая из цифр. Напишите программу, которая считает сумму цифр данной строки.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка состоящая из цифр.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести сумму цифр данной строки."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "2514\n",
    "\n",
    "Sample Output: <br/>\n",
    "12"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "num = input()\n",
    "total = 0\n",
    "\n",
    "for i in range(len(num)):\n",
    "    total += int(num[i])\n",
    "\n",
    "print(total)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
