{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step 12 - Сколько раз?\n",
    "\n",
    "На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы + и *.\n",
    "\n",
    "**Формат входных данных:** На вход программе подается одна строка.\n",
    "\n",
    "**Формат выходных данных:** Программа должна вывести сколько раз встречаются символы  + и * в строке."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test: <br/>\n",
    "Sample Input: <br/>\n",
    "bcd+a++++**31415 <br/>\n",
    "\n",
    "Sample Output: <br/>\n",
    "Символ + встречается 5 раз <br/>\n",
    "Символ * встречается 2 раз <br/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 27.10.2021\n",
    "\n",
    "string = input()\n",
    "count_mult = 0\n",
    "count_plus = 0\n",
    "\n",
    "for i in range(len(string)):\n",
    "    if string[i] == '*':\n",
    "        count_mult += 1\n",
    "    if string[i] == '+':\n",
    "        count_plus += 1\n",
    "\n",
    "print('Символ + встречается', count_plus, 'раз')\n",
    "print('Символ * встречается', count_mult, 'раз')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
